/* 

Classroom LogoКласс
Здравствуйте, Сергей.
Преподаватель Антон Олегович Подгорный опубликовал новое задание для курса "JS online".
			
	
Новое задание
	Сдать 28 янв.
Задача-3
####Задача 3

Создать имплементацию функции `every`, логика работы такая же как и у родного метода.

Функция должна содержать проверки:

- Первый параметр обязателен и может принимать только массив
- Второй параметр обязателен и может принимать только функцию

```javascript
const arr = [1,2,3];
every(arr, function(item, i, arr) {});
```
*/
